{
  "owner": "Madeline Berns",
  "policy": {
    "scope": "resume_and_portfolio_only",
    "refuse_outside": true
  },
  "sections": [
    {
      "title": "Quick Facts",
      "chunks": [
        "Most recent role: Research Assistant at Rutgers University (Aug 2023 – Jan 2025).",
        "Current status: M.S. student in Data Science at Rutgers University.",
        "Primary focus: data science, biostatistics, research tooling."
      ]
    },
    {
      "title": "Education",
      "chunks": [
        "Rutgers University (New Brunswick, NJ): M.S. in Data Science, 2025–current. GPA 3.96/4.0.",
        "Georgia Institute of Technology (Atlanta, GA): B.S. Neuroscience; Minor: Computing and Intelligence, 2019–2023. Major GPA 3.6/4.0."
      ]
    },
    {
      "title": "Skills",
      "chunks": [
        "Python: Pandas, NumPy, SciPy, PyTorch, scikit-learn, Matplotlib, Streamlit.",
        "R: linear regression, statistical analysis, hypothesis testing.",
        "Adobe Creative Cloud: Illustrator, Photoshop, InDesign.",
        "Familiar: Java, C, JMP, SQL."
      ]
    },
    {
      "title": "Experience — Rutgers Research Assistant",
      "chunks": [
        "Built Python analysis pipeline for rodent auditory decision-making behavioral data; implemented drift diffusion modeling (DDM), statistical inference, and pose-tracking with angle analysis.",
        "Built pipeline for neural recordings from electrode implants in auditory and parietal cortices; mapped electrode configuration/data to binary, spike sorting into units, developed decoders using SVM and pattern matching to predict behavior from neural activity; ran statistical analyses and linear regression.",
        "Created schematics/visuals in Adobe Illustrator and Python; contributed to papers, posters, presentations; wrote papers and fellowship applications."
      ]
    },
    {
      "title": "Experience — Georgia Tech Research Institute",
      "chunks": [
        "Performed qualitative content analysis (QCA) and frequency analyses on books, historic interview transcripts, and papers on cultural trauma/history and ontological security in Russia/Ukraine and group interactions in extremist groups.",
        "Mined online data from Russian press releases/websites; assisted ML protocol in Python; visualized data using Adobe CC."
      ]
    },
    {
      "title": "Projects",
      "chunks": [
        "Projects (from resume): Portfolio Optimization Dashboard (Streamlit), Dose-Response Curve Dashboard (BMS Challenge), CODA (Hack GT 9 ASL rhythm game), and an Alzheimer’s Assessment CNN project.",
        "Portfolio Optimization Dashboard (project, Dec 2025): built a Streamlit dashboard where investors can optimize a stock portfolio with customizable risk aversion, transaction cost, and risk‑free rate parameters.",
        "Portfolio Optimization Dashboard (project): implemented models including XGBoost, Random Forest, PCA, and CatBoost; trained on Yahoo! Finance data via API calls; resume notes XGBoost outperformed the SPY index by 4.17% in Sept 2025.",
        "Dose‑Response Curve Dashboard (project, Dec 2025; BMS Challenge at Rutgers): built a Streamlit dashboard to simulate dose‑response curves using multiple models (2-, 4-, 5‑parameter logistic; linear) with customizable parameters.",
        "Dose‑Response Curve Dashboard (project): added features to save and compare curves and to suggest optimal dilution schemes using squared‑error anchors and linear‑region coverage.",
        "CODA (project; Hack GT 9, Oct 2022): team of 4 built an interactive rhythm game to help learn American Sign Language (ASL) using computer vision to recognize and track hand movements; built with Python, Figma, and Unity; won 2nd place overall (out of 900+ participants, 191 projects).",
        "Alzheimer’s Assessment (project, May 2023): built a convolutional neural network to assess Alzheimer’s severity from CT scans; used preprocessing techniques including oversampling, cropping, PCA, and categorization; explored architectures including ResNet, AlexNet, and PCANet.",
        "Alzheimer’s Assessment (project): used Matplotlib for performance visualizations and LaTeX to illustrate model architecture (per resume)."
      ]
    },
    {
      "title": "Publications & Presentations",
      "chunks": [
        "Scientific Reports (2025): 'Auditory decision-making deficits after permanent noise-induced hearing loss.'",
        "ARO Midwinter Meeting (2024): Poster on audiovisual decision-making deficits after hearing loss (Anaheim, CA).",
        "Undergraduate Research Spring Symposium (2022): Poster on intergenerational trauma and Russian/Ukrainian cultural identities."
      ]
    }
  ]
}